app/Http/Controllers/Backend/PengaduanController.php

    public function index()
    {
        $module_title = $this->module_title;
        $module_name = $this->module_name;
        $module_path = $this->module_path;
        $module_icon = $this->module_icon;
        $module_model = $this->module_model;
        $module_name_singular = Str::singular($module_name);


        $module_action = 'List';

        $$module_name = DB::table('pengaduan')->where('email', Auth::user()->email)->paginate(10);
        // $$module_name = DB::table('pengaduan')->paginate(10);
        $module_name_super = DB::table('pengaduan')->paginate(10);
        $count = DB::table('pengaduan')->count();
---
select * from "pengaduan" where "email" = 'santochijoho@gmail.com' limit 10 offset 0
select count(*) as aggregate from "pengaduan" where "email" = 'santochijoho@gmail.com'
select * from "pengaduan" limit 10 offset 0
select count(*) as aggregate from "pengaduan"